/**
 * @file [NSX（画面）]メッセージ定数ファイル
 * @version 2020/04/09 15:30:19 … Created By fraqta-rapid-plugin
 */
export default {
  // 検索件数が0件です。
  '': '4727001',
  // {0}してもよろしいですか？
  '': '4727002',
  // {0}が完了しました。
  '': '4727003',
  // {0}の日付指定が誤っています。修正してください。
  '': '4727004',
  // {0}は{1}より後の日付を入力してください。
  '': '4727005',
  // {0}の日付は{1}以内の日付を入力してください。
  '': '4727006',
  // {0}は半角数字{1}桁で入力してください。
  '': '4727007',
  // {0}は半角の英数文字{1}桁以内で入力してください。
  '': '4727008',
  // {0}は{1}よりも小さい値を入力してください。
  '': '4727009',
  // {0}は有効な電話番号ではありません。確認の上、修正してください。
  '': '4727010',
  // データが選択されていません。データを選択してください。
  '': '4727011',
  // 印刷を受け付けました。
  '': '4727012',
  // データ種別が固定長のテンプレートはフォーマットを出力出来ません。
  '': '4727013',
  // 出荷指示先が変更された可能性があります。もう一度、出荷指示先を選択してください。
  '': '4727014',
  // 帳票出力にてエラーが発生しました。もう一度、出力を実行してください。
  '': '4727015',
  // 時間がかかりすぎているため処理を中断しました。もう一度、出力を実行してください。
  '': '4727016',
};
