# :memo: Rm コンポーネントにおける Label

Rm コンポーネントの中で呼び出される Label では、コンポーネント内での props 名の競合を避けるため、[単体の RaLabel](./RaLabel.html)とは、Props 名やキャプションの与え方が少し異なります。

## :white_check_mark: プロパティ

| 属性             | 必須 | 説明                                                                                                          | タイプ | 選択可能な値                    | デフォルト |
| ---------------- | ---- | ------------------------------------------------------------------------------------------------------------- | ------ | ------------------------------- | ---------- |
| caption          | :o:  | コンポーネント共通の ID を指定<br>ここで与えられた ID を元にラベル ID とデートピッカーの ID,name が付与される | String | -                               | -          |
| has-label        |      | ラベルの有無を選択。ただし、ラベルが無い場合でも caption は必要                                               | String | -                               | true       |
| label-class      |      | ラベルのクラス名を指定                                                                                        | String | -                               | -          |
| label-color      |      | ラベルカラーを指定                                                                                            | String | blue                            | -          |
| label-align |      | ラベル文字列の文字寄せを指定                                                                                  | String | start, end, left, right, center | right      |
| label-width      |      | ラベルの横幅を指定。width が 1 = 20px で、数値が 1 増えるたびに 20px 増加。                                   | String | 1~10                            | 4          |
